environments/cfd/rand_env_9/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

29
(
    auto0
    {
        type            wall;
        nFaces          2363;
        startFace       234023;
    }
    auto1
    {
        type            wall;
        nFaces          954;
        startFace       236386;
    }
    auto2
    {
        type            wall;
        nFaces          1555;
        startFace       237340;
    }
    auto3
    {
        type            wall;
        nFaces          3118;
        startFace       238895;
    }
    auto4
    {
        type            wall;
        nFaces          3962;
        startFace       242013;
    }
    auto5
    {
        type            wall;
        nFaces          6809;
        startFace       245975;
    }
    auto6
    {
        type            wall;
        nFaces          6101;
        startFace       252784;
    }
    auto7
    {
        type            wall;
        nFaces          739;
        startFace       258885;
    }
    auto8
    {
        type            wall;
        nFaces          151;
        startFace       259624;
    }
    auto9
    {
        type            wall;
        nFaces          650;
        startFace       259775;
    }
    auto10
    {
        type            wall;
        nFaces          1007;
        startFace       260425;
    }
    auto11
    {
        type            wall;
        nFaces          2167;
        startFace       261432;
    }
    auto12
    {
        type            wall;
        nFaces          1051;
        startFace       263599;
    }
    auto13
    {
        type            wall;
        nFaces          2024;
        startFace       264650;
    }
    auto14
    {
        type            wall;
        nFaces          880;
        startFace       266674;
    }
    auto15
    {
        type            wall;
        nFaces          583;
        startFace       267554;
    }
    auto16
    {
        type            wall;
        nFaces          874;
        startFace       268137;
    }
    auto17
    {
        type            wall;
        nFaces          1254;
        startFace       269011;
    }
    auto18
    {
        type            wall;
        nFaces          734;
        startFace       270265;
    }
    auto19
    {
        type            wall;
        nFaces          1245;
        startFace       270999;
    }
    auto20
    {
        type            wall;
        nFaces          763;
        startFace       272244;
    }
    auto21
    {
        type            wall;
        nFaces          1813;
        startFace       273007;
    }
    auto22
    {
        type            wall;
        nFaces          3;
        startFace       274820;
    }
    auto23
    {
        type            wall;
        nFaces          907;
        startFace       274823;
    }
    auto24
    {
        type            wall;
        nFaces          1070;
        startFace       275730;
    }
    auto25
    {
        type            wall;
        nFaces          695;
        startFace       276800;
    }
    auto26
    {
        type            wall;
        nFaces          684;
        startFace       277495;
    }
    auto27
    {
        type            wall;
        nFaces          568;
        startFace       278179;
    }
    auto28
    {
        type            wall;
        nFaces          880;
        startFace       278747;
    }
)

// ************************************************************************* //
