environments/cfd/rand_env_9/constant/turbulenceProperties
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}
simulationType RAS;

RAS
{
    RASModel        kEpsilon;

    turbulence      on;

    printCoeffs     on;
}
